const translate = require('translate-google')
const readline = require('readline');
const fs = require('fs');

const items = {
  "0": [
    "废墟黄色背景",
    "废墟灰色背景",
    "废墟红色背景",
    "废墟紫色背景",
    "废墟绿色背景",
    "橙色背景",
    "红色背景",
    "黄色背景",
    "蓝色背景",
    "深蓝色背景",
    "绿色背景",
    "紫色背景",
    "黑夜蝙蝠",
    "黑夜狼眼",
    "战场(黄)",
    "战场(红)",
    "绿色森林",
    "灰色森林",
    "紫色教堂",
    "灰色教堂",
    "宴厅(紫)",
    "宴厅(红)",
    "宴厅(灰)",
    "战场(紫)"
  ],
  "1": [
    "老人 方形胡",
    "老人 卷胡",
    "老人络腮胡",
    "年轻人 卷胡",
    "年轻人 络腮胡",
    "树皮",
    "老人头",
    "正常脸"
  ],
  "2": [
    "西装（绿色）",
    "西装（褐色",
    "西装（蓝色）",
    "西装 T恤（橙色",
    "西装 T恤（黄色）",
    "西装 T恤（紫色）",
    "背心",
    "夹克(蓝色)",
    "夹克(蓝色)",
    "正规西装(褐色)",
    "正规西装（蓝色）",
    "绿色毛衣",
    "毛大衣",
    "格子衣服(粉紫色)",
    "格子衣服(蓝色)",
    "格子衣服(绿色)",
    "格子衣服（灰色）",
    "披风",
    "卫衣",
    "卫衣(粉色)",
    "卫衣(绿色)",
    "卫衣(紫色)",
    "T恤(绿色)",
    "T恤(紫色)"
  ],
  "3": [
    "蝴蝶",
    "甲壳虫",
    "骷髅头",
    "玫瑰花",
    "鸟羽毛",
    "血色蝴蝶",
    "血色羽毛",
    "海马"
  ],
  "4": [
    "绿色眼睛",
    "蓝色眼睛",
    "红色眼睛",
    "紫色眼睛",
    "机械眼",
    "猫眼睛",
    "流血眼睛"
  ],
  "5": [
    "舌头",
    "雪茄",
    "香烟",
    "狼牙"
  ],
  "6": [
    "电锯惊魂 面具",
    "狐狸面具",
    "口罩",
    "脸部装饰（血液）",
    "面具(红)",
    "面具(绿)",
    "面具(紫)",
    "面具（灰）",
    "三眼",
    "鱼骨刺青",
    "异形刺青",
    "A字刺青",
    "十字纹身",
    "小丑面具",
    "墨镜",
    "v字(红)",
    "v字(蓝绿)",
    "v字(绿)",
    "v字灰"
  ],
  "7": [
    "爆炸头（红）",
    "爆炸头(蓝)",
    "爆炸头(绿)",
    "爆炸头(紫)",
    "爆炸头黑色",
    "背头（红）",
    "背头（黄）",
    "背头（蓝）",
    "背头（绿）",
    "背头（银）",
    "刀锋头",
    "卷发（黑）",
    "卷发（红）",
    "卷发（蓝）",
    "三七分（红） ",
    "三七分（蓝） ",
    "三七分（绿） ",
    "三七分（紫） ",
    "闪电头(红色)",
    "闪电头(绿色)",
    "闪电头银色"
  ],
  "8": [
    "鸭舌帽(橙)",
    "鸭舌帽(红)",
    "鸭舌帽(绿)",
    "鸭舌帽(紫)",
    "鸭舌帽黑",
    "皇冠（红）",
    "皇冠（黄）",
    "皇冠（金）",
    "皇冠（蓝绿）",
    "皇冠（绿）",
    "皇冠（银）",
    "皇冠（紫）",
    "报童帽(蓝)",
    "报童帽(绿)",
    "报童帽(紫)",
    "报童帽（红）",
    "风帽(红)",
    "风帽(绿)",
    "风帽(紫)",
    "军帽(黄)",
    "军帽(蓝)",
    "军帽(灰色)",
    "礼帽棕色",
    "圣诞帽",
    "礼帽黑色",
    "礼帽绿色",
    "礼帽紫色",
    "透明"
  ],
  "9": [
    "普通耳朵 ",
    "普通耳朵(带耳环)",
    "缺耳 (带耳环)",
    "缺耳"
  ],
  "10": [
    "白银斧头",
    "白银斧头2",
    "白银斧头3",
    "尖刀1",
    "尖刀2",
    "鞭子",
    "斧头1",
    "斧头2",
    "红酒杯1",
    "红酒杯2",
    "画笔",
    "钱包",
    "骷髅手杖",
    "猫爪",
    "玫瑰花",
    "魔法棒",
    "红魔法瓶",
    "书",
    "小提琴",
    "小提琴2",
    "红魔法瓶 星光",
    "蓝魔法瓶 星光",
    "蓝魔法瓶 星光"
  ],
  "11": [
    "青蛙",
    "蝎子",
    "黑色蝙蝠",
    "无毛猫",
    "红色蝙蝠",
    "狼头",
    "乌鸦",
    "蜥蜴",
    "蜘蛛"
  ],
  "12": [
    "阿萨迈",
    "布鲁赫",
    "茨密西",
    "梵卓",
    "冈格罗",
    "勒森布拉",
    "雷弗诺",
    "迈卡维安",
    "诺菲勒",
    "乔凡尼",
    "瑞默尔",
    "托瑞多",
    "羲太"
  ]
}
let ValueType = {}
let index = 0
ValueType[index] = []

{
  (async () => {
    for (let index = 0; index < 13; index++) {
      const item = items[index];
      ValueType[index] = []
      for (const line of item) {
        try {
          let res = await translate(line, { from: 'zh-cn', to: 'en' })
          console.log("right", line, res)
          ValueType[index].push(res)
        } catch (error) {
          console.log("error", line, error)
        }
      }
    }
    console.log(JSON.stringify(ValueType, undefined, 2))
  })()
}

{
  // const rl = readline.createInterface({
  //   input: fs.createReadStream('./zh.txt')
  // });

  // rl.on('line', async (line) => {
  //   try {
  //     if (line.length == 0) {
  //       index++
  //       ValueType[index] = []
  //     } else {
  //       // let res = await translate(line, { from: 'zh-cn', to: 'en' })
  //       // console.log("right", line, res)
  //       ValueType[index].push(line)
  //     }
  //   } catch (error) {
  //     console.log("error", line, error)
  //   }
  // });

  // rl.on('close', function () {
  //   console.log('bye bye');
  //   console.log(JSON.stringify(ValueType, undefined, 2))
  // });
}


